RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Src/stm32h5xx_hal_dts.c
/**
  **********************************************************************************************************************
  * @file    stm32h5xx_hal_dts.c
  * @author  MCD Application Team
  * @brief   DTS HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the DTS peripheral:
  *           + Initialization and de-initialization functions
  *           + Start/Stop operation functions in polling mode.
  *           + Start/Stop operation functions in interrupt mode.
  *           + Peripheral Control functions
  *           + Peripheral State functions
  *
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                      ##### DTS Peripheral features #####
  ======================================================================================================================

  [..]
      The STM32h5xx device family integrate one DTS sensor interface that converts the temperature into a square wave
      which frequency is proportional to the temperature.

       (+) Temperature window comparator feature:
           The DTS allows defining the high and low threshold that will be used for temperature comparison.
           If the temperature data is equal or higher than the high threshold, or equal or lower than the low threshold,
           an interrupt is generated and the corresponding flag.

       (+) Synchronous interrupts:
           A global interrupt output line is available on the DTS block. The interrupt can be generated
           at the end of measurement and/or when the measurement result is equal/higher or equal/lower than
           a predefined threshold.

       (+) Asynchronous wakeup:
           The DTS block provides an asynchronous interrupt line. It is used only when the LSE is selected as reference
           clock. This line can generate a signal that wakes up the system from Sleep and stop mode at the end of
           measurement and/or when the measurement result is equal/higher or equal/lower than a
           predefined threshold.

       (+) Trigger inputs:
           The temperature measurement can be triggered either by software or by an external event
           as well as lowpower timer.

       (+) Measurement modes:
           (++) Quick measure : measure without a calibration when a high precision is not required.
           (++) Slow measure  : measure with a calibration used when a high precision is required.

       (+) Sampling time:
           The sampling time can be used to increase temperature measurement precision.

       (+) Prescaler:
           When a calibration is ongoing, the counter clock must be slower than 1 MHz. This is
           achieved by the PCLK clock prescaler embedded in the temperature sensor.

       (+) Operating Modes:

           (++) PCLK only :    The temperature sensor registers can be accessed. The interface can consequently be
                               reconfigured and the measurement sequence is performed using PCLK clock.

           (++) PCLK and LSE : The temperature sensor registers can be accessed. The interface can consequently be
                               reconfigured and the measurement sequence is performed using the LSE clock.

           (++) LSE only :     The registers cannot be accessed. The measurement can be performed using the LSE
                               clock This mode is used to exit from Sleep and stop mode by using hardware triggers
                               and the asynchronous interrupt line.
       (+) Calibration:
           The temperature sensor must run the calibration prior to any frequency measurement. The calibration is
           performed automatically when the temperature measurement is triggered except for quick measurement mode.

       (+) Low power modes:
           (++) Sleep mode: only works in LSE mode.
           (++) Stop mode: only works in LSE mode.

  ======================================================================================================================
                                      ##### How to use this driver #####
  ======================================================================================================================
  [..]
      This driver provides functions to configure and program the DTS instances of STM32H5xx devices.

      To use the DTS, perform the following steps:

      (+)  Initialize the DTS low level resources by implementing the HAL_DTS_MspInit():

          (++) If required enable the DTS interrupt by configuring and enabling EXTI line in Interrupt mode After that
               enable the DTS interrupt vector using HAL_NVIC_EnableIRQ() function.

      (+) Configure the DTS using HAL_DTS_Init() function:

          (++) Select the quick measure option
          (++) Select the reference clock.
          (++) Select the trigger input.
          (++) Select the sampling time.
          (++) Select the high speed clock ratio divider.
          (++) Select the low threshold
          (++) Select the high threshold


      (+) Use HAL_DTS_Start() to enable and start the DTS sensor in polling mode.

      (+) Use HAL_DTS_Start_IT() to enable and start the DTS sensor in interrupt mode.

      (+) Use HAL_DTS_GetTemperature() to get temperature from DTS.

      (+) Use HAL_DTS_Stop() to disable and stop the DTS sensor in polling mode.

      (+) Use HAL_DTS_Stop_IT() to disable and stop the DTS sensor in interrupt mode.

